ERP DEV.WMS/src/InformationRegisters/вмс_СтатусыДокументов/вмс_СтатусыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_СтатусыДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.вмс_СтатусыДокументов</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.вмс_Помещения</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/InformationRegisters/вмс_ЖурналИсполнения/вмс_ЖурналИсполнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_ЖурналИсполнения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.вмс_ЭтапыОперации</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/AccumulationRegisters/вмс_ЗаданияКладовщикам/вмс_ЗаданияКладовщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>вмс_ЗаданияКладовщикам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоБазовыхЕдиниц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>CatalogRef.вмс_Операции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.вмс_СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP DEV.WMS/src/Enums/вмс_СостоянияЗаявокКладовщику/вмс_СостоянияЗаявокКладовщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>вмс_СостоянияЗаявокКладовщику</name>
  <enumValues>
    <name>Подготовлена</name>
  </enumValues>
  <enumValues>
    <name>Обрабатывается</name>
  </enumValues>
  <enumValues>
    <name>Завершена</name>
  </enumValues>
  <enumValues>
    <name>ЗавершенаСОшибками</name>
  </enumValues>
  <enumValues>
    <name>ЗавершенаСРасхождением</name>
  </enumValues>
</mdclass:Enum>

ERP DEV.WMS/src/Documents/вмс_ВыборочнаяИнвентаризация/вмс_ВыборочнаяИнвентаризация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>вмс_ВыборочнаяИнвентаризация</name>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.вмс_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.вмс_СтатусыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьТаблицуПустымиЯчейками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.вмс_ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.вмс_СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.вмс_КачествоТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP DEV.WMS/src/Catalogs/вмс_ПочтовыеРассылки/вмс_ПочтовыеРассылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_ПочтовыеРассылки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.КвазиСсылки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрПечати</name>
    <type>
      <types>CatalogRef.КвазиСсылки</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Свойства</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>CatalogRef.КвазиСсылки</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФормыОтправки</name>
    <attributes>
      <name>ПечатнаяФорма</name>
      <type>
        <types>CatalogRef.КвазиСсылки</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторКоманды</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_МестаХранения/вмс_МестаХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_МестаХранения</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Склады</owners>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЯчейки</name>
    <type>
      <types>EnumRef.вмс_ТипыЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииЯчеекХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.вмс_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>СортировкаНомер</name>
    <comment>Сквозная в длину нумерация (техническая)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СортировкаРяд</name>
    <comment>Сквозная в ширину нумерация (техническая)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СортировкаЭтаж</name>
    <comment>Нумерация в высоту (техническая)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаБезразмерная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТехническое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСверху</name>
    <comment>ТУ_Августинович 000056225 28.10.2025. Для интерактивной карты</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияСклад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияРяд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияСтеллаж</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияЯрус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияМесто</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_НастройкиПрограммы/вмс_НастройкиПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_НастройкиПрограммы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Значение</name>
    <type>
      <types>EnumRef.вмс_ТипыПодключенияКИС</types>
      <types>CatalogRef.вмс_МестаХранения</types>
      <types>Boolean</types>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>EnumRef.вмс_СпособыУпаковкиДанныхОбмена</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрСеанса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеЗагружатьИзИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяХранилище</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Форма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_ПравилаКонвертацииРеквизитов/вмс_ПравилаКонвертацииРеквизитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_ПравилаКонвертацииРеквизитов</name>
  <attributes>
    <name>ПравилоКонвертации</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяИсточникаВКонфигураторе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Алгоритмы</name>
    <attributes>
      <name>Алгоритм</name>
      <type>
        <types>CatalogRef.вмс_Алгоритмы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/CommonModules/вмс_ОперацииПоЯчейкамВызовСервера/Module.bsl
#Область ОбработкаОперацииВИС
// Инициализируется после завершения операции в МП
Функция ЗавершитьОперациюПоДокументу(Документ, ВидОперации, Ответственный=Неопределено, ДополнительныеДанные=Неопределено, ДокументТСД = Неопределено) Экспорт  
	
	НовыйСтатус = ПолучитьСтатусЗавершенияОперации(ВидОперации);
	Если ЗначениеЗаполнено(НовыйСтатус) Тогда
		ИзменитьСтатусДокумента(Документ, НовыйСтатус, , Ответственный);
	КонецЕсли; 
	
	АктивныеРассылки = ВидОперации.ПочтовыеРассылки.НайтиСтроки(Новый Структура("Активная", Истина));
	
	Для каждого Строка Из АктивныеРассылки Цикл
		ПочтоваяРассылка = Строка.Рассылка.ПолучитьОбъект();
		ПараметрыПечати = Новый Структура("Документ, Операция, Ответственный", Документ, ВидОперации, Ответственный);
		Справочники.вмс_ПочтовыеРассылки.Отправить(ПочтоваяРассылка, ПараметрыПечати);
	КонецЦикла;  
	
	// // ТУ_Самойленко 31.05.23 ++
	//Если ВидОперации = Справочники.вмс_Операции.НайтиПоРеквизиту("ИмяДляПоиска", "Выборочнаяинвентаризация") Тогда
	//	ПостобработкаВыборочнойИнвентаризации(Истина, Документ, ВидОперации, Ответственный, ДополнительныеДанные);
	//КонецЕсли;
	// // ТУ_Самойленко 31.05.23 -- -
	
	ИсполняемыеАлгоритмы = ВидОперации.Алгоритмы.НайтиСтроки(Новый Структура("ПриЗавершении", Истина));    
	
	ВходящиеПараметры = Новый Структура("Документ, ДокументТСД, ВидОперации, Ответственный, ДополнительныеДанные", Документ, ДокументТСД, ВидОперации, Ответственный, ДополнительныеДанные);
	
	// ТУ_Семенов 11.2025++
	// Изменение состояния задания кладовщику
	Если ЗначениеЗаполнено(Документ) И ТипЗнч(Документ) = Тип("ДокументСсылка.вмс_ЗаданиеКладовщику") Тогда 
		ИзменитьСостояниеЗаданияКладовщику(ВидОперации, Документ);
	КонецЕсли;
	// ТУ_Семенов 11.2025--
	
	Если ТипЗнч(Документ)=Тип("ДокументСсылка.вмс_ЗаданиеКладовщику") И ЗначениеЗаполнено(Документ.Распоряжение) Тогда
		Распоряжение = Документ.Распоряжение;
	Иначе
		Распоряжение = Документ;
	КонецЕсли; 
	
	Для каждого Строка Из ИсполняемыеАлгоритмы Цикл
		
		// ТУ_Васильев 13.10.24 ++
		Если ЗначениеЗаполнено(Строка.ПравилоКонвертации) Тогда
			ВыполнитьПравилоПоРаспоряжению(Распоряжение, ДокументТСД, ВидОперации, Строка.ПравилоКонвертации, ДополнительныеДанные);
		Иначе
			вмс_ОбщегоНазначенияКлиентСервер.ВыполнитьАлгоритм(Строка.Алгоритм, ВходящиеПараметры);
		КонецЕсли;
		// ТУ_Васильев 13.10.24 --
		
	КонецЦикла;
	
	СформироватьСледующиеЗаданияПоПравилуЗаполненияЗаданийКладовщикам(ДокументТСД);
	
	// ТУ_Прошин_17.04.25+
	вмс_РаботаСОповещениями.ДобавитьОповещениеВыполнениеОперации(ВходящиеПараметры);
	// ТУ_Прошин_17.04.25-
	
КонецФункции

Функция СформироватьСледующиеЗаданияПоПравилуЗаполненияЗаданийКладовщикам(ДокументТСД) Экспорт
	
	Если НЕ (ТипЗнч(ДокументТСД)=Тип("ДокументСсылка.вмс_ОперацияПоЯчейкам") И ЗначениеЗаполнено(ДокументТСД)) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ (ЗначениеЗаполнено(ДокументТСД.ДокументОснование) И ЗначениеЗаполнено(ДокументТСД.ЗаданиеКладовщику)) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Правило = ДокументТСД.ЗаданиеКладовщику.Правило.СледующееПравило;
	Если НЕ ЗначениеЗаполнено(Правило) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	вмс_ФормированиеЗаданийКладовщикам.СформироватьЗаданияПоПравилу(Правило, , ДокументТСД.ДокументОснование);
	Возврат Истина;

КонецФункции

// Инициализируется после сохранения операции в МП
Функция СохранитьОперациюПоДокументу(Документ, ВидОперации, Ответственный=Неопределено, ДополнительныеДанные=Неопределено, ДокументТСД = Неопределено) Экспорт
	// ТУ_Кошелев 28.05.24 ++
	УстановитьСтатусСПроверкой(Документ, ВидОперации, Ответственный, ДополнительныеДанные); 
	// ТУ_Кошелев 28.05.24 --
	
	// // ТУ_Самойленко 31.05.23 ++
	//Если ВидОперации = Справочники.вмс_Операции.НайтиПоРеквизиту("ИмяДляПоиска", "Выборочнаяинвентаризация") Тогда
	//	ПостобработкаВыборочнойИнвентаризации(Ложь, Документ, ВидОперации, Ответственный, ДополнительныеДанные);	
	//КонецЕсли;
	// // ТУ_Самойленко 31.05.23 --
	
	ИсполняемыеАлгоритмы = ВидОперации.Алгоритмы.НайтиСтроки(Новый Структура("ПриСохранении", Истина));
	ВходящиеПараметры = Новый Структура("Документ, ВидОперации, Ответственный, ДополнительныеДанные, ДокументТСД",Документ, ВидОперации, Ответственный, ДополнительныеДанные, ДокументТСД);
	
	Для каждого Строка Из ИсполняемыеАлгоритмы Цикл
		вмс_ОбщегоНазначенияКлиентСервер.ВыполнитьАлгоритм(Строка.Алгоритм, ВходящиеПараметры);	
	КонецЦикла;
КонецФункции

// ТУ_Мовчан 21.02.2023  
Функция УстановитьСтатусСПроверкой(Документ, Операция, Ответственный=Неопределено, ДополнительныеДанные=Неопределено, НовыйСтатусВРаботе = Истина) Экспорт
	
	Помещение = Неопределено;
	Если ТипЗнч(ДополнительныеДанные)=Тип("Структура") Тогда
		ДополнительныеДанные.Свойство("Помещение", Помещение);
	КонецЕсли;
		
	СтатусЗавершен = ПолучитьСтатусЗавершенияОперации(Операция);

	ОперацияЗавершена = РегистрыСведений.вмс_СтатусыДокументов.ПолучитьДанныеОНаличииСтатусаДокумента(Документ, СтатусЗавершен, Помещение);
	Если Не ОперацияЗавершена Тогда 	
		Если НовыйСтатусВРаботе Тогда
			НовыйСтатус = ПолучитьСтатусСохраненияОперации(Операция);
		Иначе
			НовыйСтатус = СтатусЗавершен;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НовыйСтатус) Тогда
			ИзменитьСтатусДокумента(Документ, НовыйСтатус, , Ответственный, Помещение);
		КонецЕсли;
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// ТУ_Мовчан 21.02.2023  
Функция ПолучитьДанныеОНаличииСтатуса(Документ, Операция, Статус, Помещение=Неопределено) Экспорт
	
	Если Статус = "Завершен" Тогда
		ЕстьСтатус = РегистрыСведений.вмс_СтатусыДокументов.ПолучитьДанныеОНаличииСтатусаДокумента(Документ, ПолучитьСтатусЗавершенияОперации(Операция), Помещение);
	ИначеЕсли Статус = "ВРаботе" Тогда
		ЕстьСтатус = РегистрыСведений.вмс_СтатусыДокументов.ПолучитьДанныеОНаличииСтатусаДокумента(Документ, ПолучитьСтатусСохраненияОперации(Операция), Помещение);
	КонецЕсли;
	
	Возврат ЕстьСтатус;
	
КонецФункции 

#КонецОбласти

Функция УстановитьПометкуГотовДокумента(Ссылка) Экспорт
	Объект = Ссылка.ПолучитьОбъект();
	Объект.Готов = Истина;
	Объект.Записать();
КонецФункции

// Функция - Устанавливает ПометкаУдаления для объекта. Вызывает запись объекта в СУБД
//
// Параметры:
//  СсылкиНаОбъекты	 - Массив	 - массив ссылок на документы, справочники итп.
//  Пометка			 - Булево	 -значение параметра ПометкаУдаления
// 
// Возвращаемое значение:
//  Массив - обработанные объекты, которые удалось транзакционно записать
//
Функция УстановитьПометкуУдаленияОбъектов(СсылкиНаОбъекты, Пометка=Истина) Экспорт
	
	МассивСсылокНаОбъекты = вмс_РаботаСКоллекциями.ЗначениеВМассив(СсылкиНаОбъекты, , Ложь);
	Обработанные = Новый Массив; 
	СообщениеОбОшибке = "";
	
	Для Каждого СсылкаНаОбъект Из МассивСсылокНаОбъекты Цикл
		Объект = СсылкаНаОбъект.ПолучитьОбъект();
		Если Объект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Объект.УстановитьПометкуУдаления(Пометка);
			Обработанные.Добавить(СсылкаНаОбъект);
		Исключение
			СообщениеОбОшибке = СообщениеОбОшибке + СтрШаблон("Не удалось пометить на удаление объект %1 %2", СсылкаНаОбъект, Символы.ПС);
		КонецПопытки;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СообщениеОбОшибке;
		Сообщение.Сообщить();
	КонецЕсли;
	
	Возврат Обработанные;
	
КонецФункции

Функция ОтменитьПроведениеДокументов(СсылкиНаДокументы) Экспорт
	
	МассивСсылокНаДокументы = вмс_РаботаСКоллекциями.ЗначениеВМассив(СсылкиНаДокументы, , Ложь);
	
	Для Каждого СсылкаНаДокумент Из МассивСсылокНаДокументы Цикл
		Документ = СсылкаНаДокумент.ПолучитьОбъект();
		Если Документ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не Документ.Проведен Тогда
			Продолжить;
		КонецЕсли;
		
		Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла;
	
КонецФункции

Функция ПолучитьСсылкуНаВидОперацииПоЯчейкам(ИмяДляПоиска) Экспорт
	СсылкуНаВидОперацииПоЯчейкам = Справочники.вмс_Операции.НайтиПоРеквизиту("ИмяДляПоиска", ИмяДляПоиска);
	Возврат СсылкуНаВидОперацииПоЯчейкам;
КонецФункции

Функция ПолучитьОписаниеОперации(ИмяОперации) Экспорт
	ОписаниеОперации = Справочники.вмс_Операции.ПолучитьОписаниеОперации(ИмяОперации);
	вмс_РаботаСКоллекциями.ПреобразоватьТаблицыЗначенийВКвазиТаблицыЗначенийВДанных(ОписаниеОперации);
	Возврат ОписаниеОперации;
КонецФункции

Функция ПолучитьГруппуЯчеекОтветственногоХранения() Экспорт
	
	Наименование = "Ответственное хранение";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_МестаХранения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|ГДЕ
	|	вмс_МестаХранения.ЭтоГруппа
	|	И вмс_МестаХранения.Наименование = &Наименование
	|	И НЕ вмс_МестаХранения.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		НоваяГруппа = Справочники.вмс_МестаХранения.СоздатьГруппу();
		НоваяГруппа.Наименование = Наименование;
		НоваяГруппа.Записать();
		Возврат НоваяГруппа.Ссылка;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция ЭтоВидОперацииИнвентаризация(ВидОперации) Экспорт
	
	Если ТипЗнч(ВидОперации) = Тип("СправочникСсылка.вмс_Операции") ИЛИ ТипЗнч(ВидОперации) = Тип("СправочникОбъект.вмс_Операции") Тогда
		//ИмяДляПоиска = нрег(ВидОперации.ИмяДляПоиска);
		//Если ИмяДляПоиска = "инвентаризация" Или ИмяДляПоиска = "выборочнаяинвентаризация" Тогда
		//	Возврат Истина;
		//КонецЕсли;
		Если ВидОперации.ЭтоИнвентаризация Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьАктивнуюОперациюИнвентаризацииПоЯчейкам(Оператор) Экспорт
	
	Возврат вмс_ОперацииПоЯчейкамСервер.ПолучитьАктивнуюОперациюИнвентаризацииПоЯчейкам(Оператор);
	
КонецФункции

Функция РаботаСПаллетамиБезТоварногоНаполнения(Документ) Экспорт
	
	ДополнительныйРеквизитПризнака = Справочники.вмс_НастройкиПрограммы.ПолучитьЗначениеНастройкиПрограммы("ДополнительныйРеквизитПризнакаЗаданияДляРаботыСПаллетамиБезТоварногоНаполнения");
	
	Если ДополнительныйРеквизитПризнака <> Неопределено Тогда
		ИмяДокумента = вмс_ОбщегоНазначенияВызовСервера.ПолучитьИмяТипаОбъекта(Документ);
		Если ИмяДокумента <> Неопределено Тогда
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Документ", Документ);
			Запрос.УстановитьПараметр("Свойство", ДополнительныйРеквизитПризнака);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ДополнительныеРеквизитыДокумента.Ссылка КАК Ссылка,
			|	ДополнительныеРеквизитыДокумента.Свойство КАК Свойство,
			|	ДополнительныеРеквизитыДокумента.Значение КАК Значение
			|ИЗ
			|	Документ.ПриобретениеТоваровУслуг.ДополнительныеРеквизиты КАК ДополнительныеРеквизитыДокумента
			|ГДЕ
			|	ДополнительныеРеквизитыДокумента.Ссылка = &Документ
			|	И ДополнительныеРеквизитыДокумента.Свойство = &Свойство";
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ПриобретениеТоваровУслуг", ИмяДокумента);
			РезультатЗапроса = Запрос.Выполнить();
			Если Не РезультатЗапроса.Пустой() Тогда
				ВыборкаЗапроса = РезультатЗапроса.Выбрать();
				ВыборкаЗапроса.Следующий();
				Возврат ВыборкаЗапроса.Значение = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ЗапрашиватьЭтикеткиДляКонтрагента(Знач Контрагент) Экспорт
	
	ДополнительныйРеквизитПризнака = Справочники.вмс_НастройкиПрограммы.ПолучитьЗначениеНастройкиПрограммы("ПризнакЗапросаЭтикеток");
	
	Если ДополнительныйРеквизитПризнака <> Неопределено Тогда
		ИмяОбъекта = вмс_ОбщегоНазначенияВызовСервера.ПолучитьИмяТипаОбъекта(Контрагент);
		Если ИмяОбъекта <> Неопределено Тогда
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Владелец", Контрагент);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ДополнительныеРеквизитыДокумента.Ссылка КАК Ссылка,
			|	ДополнительныеРеквизитыДокумента.Свойство КАК Свойство,
			|	ДополнительныеРеквизитыДокумента.Значение КАК Значение
			|ИЗ
			|	Справочник.Контрагенты.ДополнительныеРеквизиты КАК ДополнительныеРеквизитыДокумента
			|ГДЕ
			|	ДополнительныеРеквизитыДокумента.Ссылка = &Владелец";
			РезультатЗапроса = Запрос.Выполнить();
			Если Не РезультатЗапроса.Пустой() Тогда
				ВыборкаЗапроса = РезультатЗапроса.Выбрать();
				ВыборкаЗапроса.Следующий();
				Возврат ВыборкаЗапроса.Значение = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьКонтрагентовДляФормированияЭтикеток() Экспорт
	
	ДополнительныйРеквизитПризнака = Справочники.вмс_НастройкиПрограммы.ПолучитьЗначениеНастройкиПрограммы("ПризнакЗапросаЭтикеток");
	
	МассивКонтрагентов = Новый Массив;
	
	Если ДополнительныйРеквизитПризнака <> Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Свойство", ДополнительныйРеквизитПризнака);
		Запрос.Текст ="
		|ВЫБРАТЬ
		|	КонтрагентыДополнительныеРеквизиты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
		|ГДЕ
		|	КонтрагентыДополнительныеРеквизиты.Свойство = &Свойство
		|";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			ВыборкаЗапроса = РезультатЗапроса.Выбрать(); 
			Пока ВыборкаЗапроса.Следующий() Цикл
				МассивКонтрагентов.Добавить(ВыборкаЗапроса.Ссылка);						
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат МассивКонтрагентов;	
	
КонецФункции

Функция СоздатьПоступлениеТоваровУслугПоЗаказуПоставщику(ЗаказПоставщику,ВидОперации) Экспорт  
	
	// Кулалаев Е.С + 27.04.2022 18:49:14
	Адаптация = вмс_АдаптацияКонфигураций; 
	
	// ТУ_Мовчан 12.12.23
	ИмяДокумента = Адаптация.ПолучитьИмяПриходногоДокумента();
	ПриходныйДокумент = Документы[ИмяДокумента].СоздатьДокумент();
	ПриходныйДокумент.Заполнить(ЗаказПоставщику);
	ПриходныйДокумент.Дата = ТекущаяДата();
	
	ТаблицаПринятыхТоваров = вмс_ОперацииПоЯчейкамСервер.ПолучитьТаблицуПринятыхТоваров(ЗаказПоставщику, ВидОперации, Неопределено, Неопределено);
	ТаблицаНоменклатуры = ТаблицаПринятыхТоваров.Скопировать(,"Товар,Характеристика,Количество"); 
	ТаблицаНоменклатуры.Свернуть("Товар,Характеристика","Количество");
	
	// ТУ_Мовчан 12.12.23 ++
	ИменаТабличныхЧастей = Адаптация.ПолучитьИмяТабличнойЧасти(); 
	Если Тип("Массив") = ТипЗнч(ИменаТабличныхЧастей) Тогда
		МетаДанныеОбъекта = МетаДанные.НайтиПоПолномуИмени(ИмяДокумента);
		Если МетаДанныеОбъекта <> Неопределено И МетаДанные.Документы.Содержит(МетаДанныеОбъекта) Тогда
			Для Каждого ИмяТабЧасти Из ИменаТабличныхЧастей Цикл
				МетаДанныеТабличнойЧасти = МетаДанныеОбъекта.ТабличныеЧасти.Найти(ИмяТабЧасти);
				Если МетаДанныеТабличнойЧасти <> Неопределено Тогда
					ИмяТабличнойЧасти = ИмяТабЧасти;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Иначе
		ИмяТабличнойЧасти = ИменаТабличныхЧастей;
	КонецЕсли;
	ТабличнаяЧасть = ПриходныйДокумент[ИмяТабличнойЧасти];
	// ТУ_Мовчан 12.12.23 --
	//ТабличнаяЧасть = ПриходныйДокумент[адап.ПолучитьИмяТабличнойЧасти()];
	ТабличнаяЧасть.Очистить();
	
	Для каждого Строка Из ТаблицаНоменклатуры Цикл 
		
		нСтрока = ТабличнаяЧасть.Добавить(); 
		ЗаполнитьЗначенияСвойств(нСтрока,Строка);
		нСтрока.Номенклатура = Строка.Товар;
		нСтрока[Адаптация.ИмяКолонкиЕдиницаИзмерения()] = Строка.Товар[Адаптация.ИмяРеквизитаНоменклатурыЕдиницаИзмерения()]
		
	КонецЦикла;   
	
	ПриходныйДокумент.Записать();	
	// Кулалаев Е.С -
	
	
КонецФункции

#Область РаботаСоСтатусами 

Функция ИзменитьСтатусДокумента(Документ, НовыйСтатус, Период=Неопределено, Ответственный=Неопределено, Помещение=Неопределено) Экспорт    
	// ТУ_Кошелев/Кулалаев 10.11.23 ++
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.вмс_СводныйДокумент") Тогда
		Для каждого Строка Из Документ.ДокументыОснования Цикл
			РегистрыСведений.вмс_СтатусыДокументов.ИзменитьСтатусДокумента(Строка.Документ, НовыйСтатус, Период, Ответственный, Помещение);		
		КонецЦикла;
	КонецЕсли;
	// ТУ_Кошелев/Кулалаев 10.11.23 --
	
	Возврат РегистрыСведений.вмс_СтатусыДокументов.ИзменитьСтатусДокумента(Документ, НовыйСтатус, Период, Ответственный, Помещение);
КонецФункции

Функция ПолучитьСсылкуСтатусаДокумента(Значение) Экспорт
	Возврат РегистрыСведений.вмс_СтатусыДокументов.ПолучитьСсылкуСтатуса(Значение);
КонецФункции

Функция ПолучитьСтатусЗавершенияОперации(Операция) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Операция", Операция);
	Запрос.УстановитьПараметр("ИмяЭтапа", "Завершена");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ОперацииЭтапыОперации.Ссылка КАК Ссылка,
	|	вмс_ОперацииЭтапыОперации.Этап КАК Этап,
	|	вмс_ОперацииЭтапыОперации.Статус КАК Статус
	|ИЗ
	|	Справочник.вмс_Операции.ЭтапыОперации КАК вмс_ОперацииЭтапыОперации
	|ГДЕ
	|	вмс_ОперацииЭтапыОперации.Ссылка = &Операция
	|	И вмс_ОперацииЭтапыОперации.Этап.Имя = &ИмяЭтапа";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Статус;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСтатусСохраненияОперации(Операция) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Операция", Операция);
	Запрос.УстановитьПараметр("ИмяЭтапа", "ВРаботе");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ОперацииЭтапыОперации.Ссылка КАК Ссылка,
	|	вмс_ОперацииЭтапыОперации.Этап КАК Этап,
	|	вмс_ОперацииЭтапыОперации.Статус КАК Статус
	|ИЗ
	|	Справочник.вмс_Операции.ЭтапыОперации КАК вмс_ОперацииЭтапыОперации
	|ГДЕ
	|	вмс_ОперацииЭтапыОперации.Ссылка = &Операция
	|	И вмс_ОперацииЭтапыОперации.Этап.Имя = &ИмяЭтапа";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Статус;
	КонецЕсли;
	
КонецФункции

// ТУ_Васильев 18.02.26 ++
Функция ИзменитьСтатусыДокументовПоРаспоряжению(Рспоряжение, НовыйСтатус, Период=Неопределено, Ответственный=Неопределено ) Экспорт    
	
	Текст = "
	|ВЫБРАТЬ
	|	вмс_СтатусыДокументовСрезПоследних.Документ КАК Документ,
	|	вмс_СтатусыДокументовСрезПоследних.Помещение КАК Помещение,
	|	вмс_СтатусыДокументовСрезПоследних.Распоряжение КАК Распоряжение,
	|	вмс_СтатусыДокументовСрезПоследних.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.вмс_СтатусыДокументов.СрезПоследних(, Распоряжение = &Рспоряжение И Статус <> &Статус ) КАК вмс_СтатусыДокументовСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	вмс_СтатусыДокументовСрезПоследних.Документ,
	|	вмс_СтатусыДокументовСрезПоследних.Помещение,
	|	вмс_СтатусыДокументовСрезПоследних.Распоряжение,
	|	вмс_СтатусыДокументовСрезПоследних.Статус
	|";
	
	Запрос = Новый Запрос(Текст);
	
	Запрос.УстановитьПараметр("Рспоряжение", Рспоряжение);
	Запрос.УстановитьПараметр("Статус", НовыйСтатус);
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		РегистрыСведений.вмс_СтатусыДокументов.ИзменитьСтатусДокумента(Выборка.Документ, НовыйСтатус, Период, Ответственный, Выборка.Помещение);
	КонецЦикла;
	
КонецФункции

#КонецОбласти

Функция ПолучитьСписокИспользуемыхРаспоряжений() Экспорт
	
	// ТУ_Прошин_17.05.24++
	// В запросе доставалось Имя, но видимо что то изменилось, запрос был пустым, теперь нужно доставать "РаспоряжениеКонфигуратор"
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	вмс_РаспоряженияОпераций.РаспоряжениеКонфигуратор КАК Распоряжение
	//|ИЗ
	//|	Справочник.вмс_Операции КАК вмс_Операции
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.вмс_Операции.Распоряжения КАК вмс_ОперацииРаспоряжения
	//|		ПО (вмс_Операции.Ссылка = вмс_ОперацииРаспоряжения.Ссылка)
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.вмс_РаспоряженияОпераций КАК вмс_РаспоряженияОпераций
	//|		ПО (вмс_ОперацииРаспоряжения.СсылкаНаРаспоряжение = вмс_РаспоряженияОпераций.Ссылка)
	//|ГДЕ
	//|	НЕ вмс_Операции.ПометкаУдаления
	//|	И НЕ вмс_РаспоряженияОпераций.ПометкаУдаления
	//|";
	
	// ТУ_Макеев 25.03.26 ++
	// Теперь распоряжения достаются из "Правила заполения задачи кладовщику" вместо "Распоряжения операций"
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_ПравилаЗаполненияЗадачиКладовщику.РаспоряжениеКонфигуратор КАК Распоряжение
		|ИЗ
		|	Справочник.вмс_ПравилаЗаполненияЗадачиКладовщику КАК вмс_ПравилаЗаполненияЗадачиКладовщику
		|ГДЕ
		|	НЕ вмс_ПравилаЗаполненияЗадачиКладовщику.ПометкаУдаления";
	// ТУ_Макеев 25.03.26 --
	
	РезультатЗапроса = Запрос.Выполнить();
	МассивРаспоряжений = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Распоряжение");
	
	Возврат МассивРаспоряжений;
	
КонецФункции

///////////////////////////////////////////////////////////////////
//
//			Настройка товарных полей+
//

Функция ИспользуемыеТоварныеПоля(УдалитьУпаковки = Ложь) Экспорт
	
	ПараметрыПриложения = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыПриложения();
	
	НастройкаТоварныхПолейСсылка = ПараметрыПриложения["НастройкаТоварныхПолейСсылка"];
	Если НастройкаТоварныхПолейСсылка=Неопределено Тогда
		НастройкаТоварныхПолейСсылка = Справочники.вмс_НастройкиПрограммы.ПолучитьНастройкуПрограммы("НастройкаТоварныхПолей");
		ПараметрыПриложения["НастройкаТоварныхПолейСсылка"] = НастройкаТоварныхПолейСсылка;
	КонецЕсли;
	
	ВерсияНастройкиТоварныхПолей = вмс_ОбщегоНазначенияВызовСервера.ВерсияДанных(НастройкаТоварныхПолейСсылка);
	Если ПараметрыПриложения["ВерсияНастройкиТоварныхПолей"]=ВерсияНастройкиТоварныхПолей Тогда
		// Возьмем из кэша так, как при частом обращении к этой функции добавляется заметная задержка выполнения кода
		ИспользуемыеТоварныеПоля = вмс_РаботаСКоллекциями.СкопироватьОбъект(ПараметрыПриложения["ИспользуемыеТоварныеПоля"]);
	Иначе
		НастройкаТоварныхПолей = вмс_ОперацииПоЯчейкамСервер.ПолучитьНастройкуТоварныхПолей();
		ИспользуемыеТоварныеПоля = вмс_ОперацииПоЯчейкамКлиентСервер.ИспользуемыеТоварныеПоляНастройкиТоварныхПолей(НастройкаТоварныхПолей);
		ПараметрыПриложения["ИспользуемыеТоварныеПоля"] = ИспользуемыеТоварныеПоля;
		ПараметрыПриложения["ВерсияНастройкиТоварныхПолей"] = ВерсияНастройкиТоварныхПолей;
	КонецЕсли;
	
	// ТУ_Кошелев 14.01.25 - перенес настройку в функцию чтобы не плодить лишние функции в модулях
	// ""Временное"" решение для работоспособности формы при включенных упаковках в товарных полях (их надо удалить из
	// товарныхъ полей в принципе)
	Если УдалитьУпаковки Тогда
		ИндексУпаковки = ИспользуемыеТоварныеПоля.Найти("Упаковка");
		Если ИндексУпаковки <> Неопределено Тогда
			ИспользуемыеТоварныеПоля.Удалить(ИндексУпаковки);
		КонецЕсли;
	КонецЕсли;
	//
	
	Возврат ИспользуемыеТоварныеПоля;
	
КонецФункции

Функция ПолучитьНастройкуТоварныхПолей() Экспорт
	
	НастройкаТоварныхПолей = вмс_ОперацииПоЯчейкамСервер.ПолучитьНастройкуТоварныхПолей();
	
	Если ТипЗнч(НастройкаТоварныхПолей.ТаблицаПолей) = Тип("ТаблицаЗначений") Тогда
		НастройкаТоварныхПолей.ТаблицаПолей = вмс_РаботаСКоллекциями.НоваяКвазиТаблицаЗначений(НастройкаТоварныхПолей.ТаблицаПолей);
	КонецЕсли;
	
	Возврат НастройкаТоварныхПолей;
	
КонецФункции

Функция ПолучитьТекстСКДИсточникаПредставленийТоварныхПолей() Экспорт
	
	СКД = вмс_ОперацииПоЯчейкамСервер.ПолучитьСКДИсточникаПредставленийТоварныхПолей();
	
	ТекстСКД = вмс_ОбщегоНазначенияКлиентСервер.ПолучитьТекстОбъектаXDTO(СКД);
	
	Возврат ТекстСКД;
	
КонецФункции

//
//			Настройка товарных полей-
//
///////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////
//
//							Выборочная инвентаризация+
//

// ТУ_Самойленко 31.05.23 ++

Функция ПостобработкаВыборочнойИнвентаризации(ЗавершениеОперации=Ложь, Документ=Неопределено, Операция=Неопределено, Ответственный=Неопределено, ДополнительныеДанные=Неопределено) Экспорт
	
	Если ЗавершениеОперации Тогда
		ВИ_ОтменаПроведенияПрошлогоРезультата(Документ, Операция, Ответственный, ДополнительныеДанные);
		ВИ_ЗаполнениеСтатусаИсполнителя(Документ, Операция, Ответственный, ДополнительныеДанные);
		ВИ_СменаСтатусаРаспоряжения(Документ, Операция, Ответственный, ДополнительныеДанные);
	Иначе
		ВИ_ОтменаПроведенияПрошлогоРезультата(Документ, Операция, Ответственный, ДополнительныеДанные);	
	КонецЕсли;
	
КонецФункции 

Функция ВИ_ЗаполнениеСтатусаИсполнителя(Документ=Неопределено, Операция=Неопределено, Ответственный=Неопределено, ДополнительныеДанные=Неопределено) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.вмс_ЖурналИсполнения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Заполнить(Неопределено);
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Документ = Документ;
	МенеджерЗаписи.Ответственный = Ответственный;
	МенеджерЗаписи.Статус = Справочники.вмс_ЭтапыОперации.НайтиПоНаименованию("Завершена");
	МенеджерЗаписи.Записать();
	
КонецФункции

Функция ВИ_ОтменаПроведенияПрошлогоРезультата(Документ=Неопределено, Операция=Неопределено, Ответственный=Неопределено, ДополнительныеДанные=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкам.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.вмс_ОперацияПоЯчейкам КАК вмс_ОперацияПоЯчейкам
	|ГДЕ
	|	вмс_ОперацияПоЯчейкам.ДокументОснование = &Документ
	|	И вмс_ОперацияПоЯчейкам.ВидОперации = &ВидОперации
	|	И вмс_ОперацияПоЯчейкам.Ответственный = &Ответственный
	|	И вмс_ОперацияПоЯчейкам.Проведен = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка УБЫВ
	|";
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("ВидОперации", Операция);
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Количество() > 1 Тогда
		
		Результат.Следующий(); //Холостой прогон, для исключения последнего документа
		
		Пока Результат.Следующий() Цикл
			
			СтараяОперация = Результат.Ссылка.ПолучитьОбъект();
			СтараяОперация.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции 

Функция ВИ_СменаСтатусаРаспоряжения(Документ=Неопределено, Операция=Неопределено, Ответственный=Неопределено, ДополнительныеДанные=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	вмс_СтатусыИсполнителей.Ответственный КАК Исполнитель
	|ПОМЕСТИТЬ Завершили
	|ИЗ
	|	РегистрСведений.вмс_ЖурналИсполнения КАК вмс_СтатусыИсполнителей
	|ГДЕ
	|	вмс_СтатусыИсполнителей.Статус = &СтатусИсполнителя
	|	И вмс_СтатусыИсполнителей.Документ = &Документ
	|
	|СГРУППИРОВАТЬ ПО
	|	вмс_СтатусыИсполнителей.Ответственный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_ВыборочнаяИнвентаризацияТовары.Исполнитель КАК Исполнитель
	|ПОМЕСТИТЬ Участники
	|ИЗ
	|	Документ.вмс_ВыборочнаяИнвентаризация.Товары КАК вмс_ВыборочнаяИнвентаризацияТовары
	|ГДЕ
	|	вмс_ВыборочнаяИнвентаризацияТовары.Ссылка = &Документ
	|
	|СГРУППИРОВАТЬ ПО
	|	вмс_ВыборочнаяИнвентаризацияТовары.Исполнитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Участники.Исполнитель КАК Исполнитель,
	|	ЕСТЬNULL(Завершили.Исполнитель, 0) КАК Завершил
	|ПОМЕСТИТЬ Результаты
	|ИЗ
	|	Участники КАК Участники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Завершили КАК Завершили
	|		ПО Участники.Исполнитель = Завершили.Исполнитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Результаты.Исполнитель КАК Исполнитель
	|ИЗ
	|	Результаты КАК Результаты
	|ГДЕ
	|	Результаты.Завершил = 0
	|";
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("СтатусИсполнителя", Справочники.вмс_ЭтапыОперации.НайтиПоНаименованию("Завершена"));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка <> Неопределено Тогда
		Если Выборка.Количество() = 0 Тогда
			
			ДокументОбъект = Документ.ПолучитьОбъект();
			ДокументОбъект.Статус = Справочники.вмс_СтатусыДокументов.ПолучитьСтатус("Ожидает подтверждения", "Выборочная инвентаризация");
			ДокументОбъект.Записать();
			
			МенеджерЗаписи = РегистрыСведений.вмс_СтатусыДокументов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Заполнить(Неопределено);
			МенеджерЗаписи.Период = ТекущаяДата();
			МенеджерЗаписи.Документ = Документ;
			МенеджерЗаписи.Ответственный = Ответственный;
			МенеджерЗаписи.Статус = Справочники.вмс_СтатусыДокументов.ПолучитьСтатус("Ожидает подтверждения", "Выборочная инвентаризация");
			МенеджерЗаписи.Записать();
			
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

// ТУ_Самойленко 31.05.23 --

//
//							Выборочная инвентаризация-
//
///////////////////////////////////////////////////////////////////  

// ТУ_Самойленко 21.06.23 ++
Функция ПолучитьРезультатОбработчика(ПараметрыАлгоритма, ИмяОбработчика=Неопределено) Экспорт
	
	ДополнительныеДанные = Неопределено;
	Если ПараметрыАлгоритма.Свойство("ДополнительныеДанные", ДополнительныеДанные) Тогда
		Если ТипЗнч(ДополнительныеДанные) = Тип("Структура") Тогда
			Если ЗначениеЗаполнено(ИмяОбработчика) Тогда
				СтрокаОбработчика = вмс_РаботаСКоллекциями.НайтиСтрокиКвазиТаблицыЗначений(ДополнительныеДанные, Новый Структура("ИмяОбработчика", ИмяОбработчика));
			Иначе
				СтрокаОбработчика = ДополнительныеДанные.Строки;		
			КонецЕсли;
		ИначеЕсли ТипЗнч(ДополнительныеДанные) = Тип("ТаблицаЗначений") Тогда 
			Если ЗначениеЗаполнено(ИмяОбработчика) Тогда
				СтрокаОбработчика = ДополнительныеДанные.НайтиСтроки(Новый Структура("ИмяОбработчика", ИмяОбработчика));
			Иначе
				СтрокаОбработчика = ДополнительныеДанные;	
			КонецЕсли;
		Иначе
			Возврат Неопределено;	
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаОбработчика) Тогда
			Возврат СтрокаОбработчика[0].Результат;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции
// ТУ_Самойленко 21.06.23 --

// ТУ_Кошелев 19.05.25 - унифицировал логику с функцией МП:ОперацииПоЯчейкамВызовСервера.ПолучитьЗонуОтгрузки - проверка
// и создание вызывается с мобилки
//Функция ПолучитьЗонуПриемки(Фильтры = Неопределено) Экспорт
//	
//	ТипЯчейки = Перечисления.вмс_ТипыЯчеек.ЗонаПриемки;
//	ЗонаПриемки = НайтиМестоХранения(ТипЯчейки, Фильтры);
//	
//	Если НЕ ЗначениеЗаполнено(ЗонаПриемки) Тогда
//		ЗонаПриемки = СоздатьМестоХранения(Фильтры.Склад, ТипЯчейки);
//	КонецЕсли;
//	
//	Возврат ЗонаПриемки;
//	
//КонецФункции

Функция НайтиМестоХранения(ТипМестаХранения, Фильтры = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МестаХранения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК МестаХранения
	|ГДЕ
	|	НЕ МестаХранения.ЭтоГруппа
	|	И НЕ МестаХранения.ПометкаУдаления
	|	И МестаХранения.ТипЯчейки = &ТипЯчейки
	|	И &Отборы";
	
	Запрос.УстановитьПараметр("ТипЯчейки", ТипМестаХранения); 
	
	Если Фильтры <> Неопределено Тогда  
		
		ДопОтборы = "";
		
		Если Фильтры.Свойство("Склад") Тогда 
			Склад = Фильтры.Склад; 
			Если НЕ ЗначениеЗаполнено(Склад) Тогда
				Склад = вмс_ОперацииПоЯчейкамСервер.ПолучитьСкладПоУмолчанию();
			КонецЕсли;
			
			ДопОтборы = ДопОтборы + "МестаХранения.Владелец = &Склад" + Символы.ПС; 
			Запрос.УстановитьПараметр("Склад", Склад);
		КонецЕсли; 
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отборы", ДопОтборы);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отборы", "Истина");			
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.вмс_МестаХранения.ПустаяСсылка();
	
	
КонецФункции

// ТУ_Самойленко 18.08.23 ++ 
Функция СоздатьМестоХранения(Склад, ТипЯчейки, Наименование=Неопределено) Экспорт
	
	Ячейка = Справочники.вмс_МестаХранения.СоздатьЭлемент();
	Ячейка.Заполнить(Неопределено);
	
	Ячейка.Владелец = Склад;
	Ячейка.ТипЯчейки = ТипЯчейки;
	
	Если Наименование = Неопределено Тогда
		Ячейка.Наименование = "" + ТипЯчейки + "(" + Склад + ")";	
	Иначе
		Ячейка.Наименование = "" + Наименование;	
	КонецЕсли; 
	
	Ячейка.Записать();
	
	Возврат Ячейка.Ссылка;
	
КонецФункции
// ТУ_Самойленко 18.08.23 --  

// ТУ_Васильев 07.10.24 ++

Функция ВыполнитьПравилоПоРаспоряжению(Документ, ДокументТСД, ВидОперации, ПравилоКонвертации, ДополнительныеДанные = Неопределено)
	
	ПравилоВыполнения = Справочники.вмс_ПравилаКонвертацииРеквизитов.ПолучитьПустыеПараметрыВыполненияПравила();
	ПравилоВыполнения.ОперацияПоЯчейкам = ДокументТСД;
	ПравилоВыполнения.ОперацияТСД = ВидОперации;      
	
	Если ЗначениеЗаполнено(Документ) Тогда
		ПравилоВыполнения.Источник =  Документ;
	Иначе	
		ПравилоВыполнения.Источник =  ДокументТСД;
	КонецЕсли;
	
	Справочники.вмс_ПравилаКонвертацииРеквизитов.ВыполнитьПравилоКонвертации(ПравилоКонвертации,ПравилоВыполнения, ДополнительныеДанные);
	
КонецФункции


Функция СхемаСоединения_ИспользованиеСерий() Экспорт
	// Использование учета серий по товарам
	Возврат Справочники.вмс_СхемыСоединенияОбъектов.ПолучитьСсылку(Новый УникальныйИдентификатор("10fb5143-c343-11ed-8759-7c10c944d3e9"));
КонецФункции

Функция СхемаСоединения_ВидыНастроекСерий() Экспорт
	// Виды партий для видов товаров
	Возврат Справочники.вмс_СхемыСоединенияОбъектов.ПолучитьСсылку(Новый УникальныйИдентификатор("d6f40188-7ba8-11ed-873d-7c10c944d3e9"));
КонецФункции

Функция ПолучитьТаблицуОстатковВЯчейкахЧерезСтруктуру(ВходящиеПараметры) Экспорт
	
	ТаблицаРезультата = вмс_ОперацииПоЯчейкамСервер.ПолучитьТаблицуОстатковВЯчейкахЧерезСтруктуру(ВходящиеПараметры);
	
	// для передачи на клиент
	КвазиТаблицаРезультата = вмс_РаботаСКоллекциями.НоваяКвазиТаблицаЗначений(ТаблицаРезультата);
	
	Возврат КвазиТаблицаРезультата;
	
КонецФункции

///////////////////////////////////////////////////////////////////
//
//							Задания кладовщикам+
//

// ТУ_Семенов 11.2025++ 
Процедура ИзменитьСостояниеЗаданияКладовщику(Операция, ЗаданиеКладовщику)
	
	ОбъектЗаданиеКладовщику = ЗаданиеКладовщику.ПолучитьОбъект();
	
	//Если ЗаданиеЗавершеноСОшибками(ЗаданиеКладовщику) Тогда 
	//	ОбъектЗаданиеКладовщику.Состояние = Перечисления.вмс_СостоянияЗаявокКладовщику.ЗавершенаСОшибками;	
	//ИначеЕсли ЗаданиеЗавершеноСРасхождением(Операция, ЗаданиеКладовщику) Тогда 
	//	ОбъектЗаданиеКладовщику.Состояние = Перечисления.вмс_СостоянияЗаявокКладовщику.ЗавершенаСРасхождением;			
	//Иначе
	//	ОбъектЗаданиеКладовщику.Состояние = Перечисления.вмс_СостоянияЗаявокКладовщику.Завершена;	
	//КонецЕсли;
	
	ОбъектЗаданиеКладовщику.Состояние = Перечисления.вмс_СостоянияЗаявокКладовщику.Завершена;	
	РежимЗаписи = ?(ОбъектЗаданиеКладовщику.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
	ОбъектЗаданиеКладовщику.Записать(РежимЗаписи);
	
КонецПроцедуры

Функция ЗаданиеЗавершеноСРасхождением(Операция, ЗаданиеКладовщику)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_ЗаданияКладовщикамОстаткиИОбороты.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрНакопления.вмс_ЗаданияКладовщикам.ОстаткиИОбороты(
	|			,
	|			,
	|			Регистратор,
	|			,
	|				Операция = &Операция) КАК вмс_ЗаданияКладовщикамОстаткиИОбороты
	|ГДЕ
	|	вмс_ЗаданияКладовщикамОстаткиИОбороты.Регистратор.ЗаданиеКладовщику = &ЗаданиеКладовщику
	|	И вмс_ЗаданияКладовщикамОстаткиИОбороты.КоличествоКонечныйОстаток <> 0";
	
	Запрос.УстановитьПараметр("Операция", Операция);
	Запрос.УстановитьПараметр("ЗаданиеКладовщику", ЗаданиеКладовщику);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ЗаданиеЗавершеноСОшибками(ЗаданиеКладовщику)
	
	// Функци нужна для определения состояния задания кладовщику "Завершена с ошибками"
	Возврат Ложь;
	
КонецФункции
// ТУ_Семенов 11.2025--

//
//							Задания кладовщикам-
//
///////////////////////////////////////////////////////////////////
